## Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [3]:
df1 = pd.Series([4,8,15,16,23,42])
print(df1)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [6]:
type(df1)

pandas.core.series.Series

## Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it

In [4]:
ls = range(10)

sr = pd.Series(ls)
sr

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [5]:
type(sr)

pandas.core.series.Series

## Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame

In [7]:
df2 = pd.DataFrame( {"Name":["Alice","Bob","Claire"], "Age": [25,30,27], "Gender": ["Female" ,"Male" ,"Female"] } )

In [8]:
df2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

type(df2)

In [9]:
df2.dtypes

Name      object
Age        int64
Gender    object
dtype: object

## Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A DataFrame is a data structure in Pandas that is used to store two-dimensional labeled data. The main difference between a DataFrame and a Series is that a DataFrame is a two-dimensional array of data, while a Series is a one-dimensional array of data. In other words, a Series represents a single column of data, while a DataFrame is essentially a collection of Series objects, each one representing a column of data. For example, we can extract all columns from df2 DataFrame as series :

In [11]:
name = df2["Name"]
age = df2["Age"]
gender = df2["Gender"]

In [12]:
print(name,age,gender)

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object 0    25
1    30
2    27
Name: Age, dtype: int64 0    Female
1      Male
2    Female
Name: Gender, dtype: object

In [13]:
print(type(name),type(age),type(gender))

<class 'pandas.core.series.Series'> <class 'pandas.core.series.Series'> <class 'pandas.core.series.Series'>

## Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Some common functions to manipulate data in pandas are:

In [14]:
# head is used to show the first 5 elements in the dataframe  
df3 = pd.read_html("https://www.basketball-reference.com/leagues/NBA_2015_totals.html" )
df3 = df3[0]

In [16]:
df3.head()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035

In [17]:
# tail is used to show the last 5 elements in the dataframe
df3.tail()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
670,490,Thaddeus Young,PF,26,TOT,76,68,2434,451,968,...,.655,127,284,411,173,124,25,117,171,1071
671,490,Thaddeus Young,PF,26,MIN,48,48,1605,289,641,...,.682,75,170,245,135,86,17,75,115,685
672,490,Thaddeus Young,PF,26,BRK,28,20,829,162,327,...,.606,52,114,166,38,38,8,42,56,386
673,491,Cody Zeller,C,22,CHO,62,45,1487,172,373,...,.774,97,265,362,100,34,49,62,156,472
674,492,Tyler Zeller,C,25,BOS,82,59,1731,340,619,...,.823,146,319,465,113,18,52,76,205,833

In [18]:
# info is used to display summary of the dataframe
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 675 entries, 0 to 674
Data columns (total 30 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Rk      675 non-null    object
 1   Player  675 non-null    object
 2   Pos     675 non-null    object
 3   Age     675 non-null    object
 4   Tm      675 non-null    object
 5   G       675 non-null    object
 6   GS      675 non-null    object
 7   MP      675 non-null    object
 8   FG      675 non-null    object
 9   FGA     675 non-null    object
 10  FG%     673 non-null    object
 11  3P      675 non-null    object
 12  3PA     675 non-null    object
 13  3P%     594 non-null    object
 14  2P      675 non-null    object
 15  2PA     675 non-null    object
 16  2P%     671 non-null    object
 17  eFG%    673 non-null    object
 18  FT      675 non-null    object
 19  FTA     675 non-null    object
 20  FT%     650 non-null    object
 21  ORB     675 non-null    object
 22  DRB     675 non-null    object
 23  TRB     675 non-null    object
 24  AST     675 non-null    object
 25  STL     675 non-null    object
 26  BLK     675 non-null    object
 27  TOV     675 non-null    object
 28  PF      675 non-null    object
 29  PTS     675 non-null    object
dtypes: object(30)
memory usage: 158.3+ KB

In [19]:
# describe is used to display some summary statistic 
df3.describe()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
count,675,675,675,675,675,675,675,675,675,675,...,650,675,675,675,675,675,675,675,675,675
unique,493,493,12,21,32,84,81,557,327,458,...,275,165,293,350,249,119,98,177,214,463
top,Rk,Player,SG,23,TOT,82,0,MP,FG,FGA,...,.500,1,DRB,TRB,AST,0,0,TOV,PF,PTS
freq,24,24,145,86,76,27,179,24,24,24,...,29,30,24,24,24,29,88,24,24,24

In [20]:
# dtypes is used to display columns type
df3.dtypes

Rk        object
Player    object
Pos       object
Age       object
Tm        object
G         object
GS        object
MP        object
FG        object
FGA       object
FG%       object
3P        object
3PA       object
3P%       object
2P        object
2PA       object
2P%       object
eFG%      object
FT        object
FTA       object
FT%       object
ORB       object
DRB       object
TRB       object
AST       object
STL       object
BLK       object
TOV       object
PF        object
PTS       object
dtype: object

## Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

A Series and a DataFrame are mutable in nature, meaning that their elements can be modified after they are created. A Panel, on the other hand, is an immutable data structure in Pandas, meaning that its elements cannot be modified after it is created.

## Q7. Create a DataFrame using multiple Series. Explain with an example.

In [22]:
Player = pd.Series(["Quincy Acy", "Jordan Adams","Steven Adams"])
Age = pd.Series([24,20,21])
Tm = pd.Series(["NYK", "MEM", "OKC"])

df4 = pd.DataFrame( { "Player": Player ,"Age": Age, "Tm": Tm } )
df4

         Player  Age   Tm
0    Quincy Acy   24  NYK
1  Jordan Adams   20  MEM
2  Steven Adams   21  OKC